#include <iostream>
#include <iomanip>
#include <locale.h>
#include <windows.h>

using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int v = 5;
    // шапка таблицы
    cout << "__________________________________________________________________________________________________________________________________________________" << endl;
    cout << setw(8) << "No п/п" << setw(20) << " Табельний номер"
        << setw(32) << "Тарифна ставка години, грн." << setw(38) << "Фактично відпрацьований час, год."
        << setw(20) << "Тарифний розряд" << setw(26) << " Заробітна плата, грн." << endl;
    cout << "__________________________________________________________________________________________________________________________________________________" << endl;
    //виведення рядків таблиці
    for (int i = 0; i < v; i++
    {
        cout << setw(5) << i + 1 << setw(15) << 1
            << setw(32) << 50 << setw(35) << 60
            << setw(23) << 4 << setw(26) << 10000 << endl;

      cout << "__________________________________________________________________________________________________________________________________________________" << endl;
    }
    cout << setw(23) << "Усього" << setw(65) << 600 << setw(48) << 15000 << endl;

    
}

